handouts/lecture_notes/lecture_11/slides_lecture_11.org
#+TITLE: Lecture 11: Assessing Studies Based on Multiple Regression
#+AUTHOR: Zheng Tian
#+DATE: 
#+STARTUP: beamer
#+OPTIONS: toc:1 H:2
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation,10pt]
#+BEAMER_THEME: CambridgeUS
#+BEAMER_COLOR_THEME: beaver
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC
#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \newtheorem{mydef}{Definition}
#+LATEX_HEADER: \newtheorem{mythm}{Theorem}
#+LATEX_HEADER: \newcommand{\dx}{\mathrm{d}}
#+LATEX_HEADER: \newcommand{\var}{\mathrm{var}}
#+LATEX_HEADER: \newcommand{\cov}{\mathrm{cov}}
#+LATEX_HEADER: \newcommand{\corr}{\mathrm{corr}}
#+LATEX_HEADER: \newcommand{\pr}{\mathrm{Pr}}
#+LATEX_HEADER: \newcommand{\rarrowd}[1]{\xrightarrow{\text{ \textit #1 }}}
#+LATEX_HEADER: \DeclareMathOperator*{\plim}{plim}
#+LATEX_HEADER: \newcommand{\plimn}{\plim_{n \rightarrow \infty}}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{caption}
#+LATEX_HEADER: \usepackage{subcaption}

* COMMENT Warm-up exercises                                 :B_ignoreheading:
:PROPERTIES:
:BEAMER_env: ignoreheading
:END:
** Warm-up exercises
:PROPERTIES:
:BEAMER_opt: shrink
:END:
*** The interpretation of the slope coefficient in the model $\ln(Y_i) = \beta_0 + \beta_1 \ln(X_i)+ u_i$ is as follows:
- A) :: a 1% change in X is associated with a \beta_{1}% change in Y.
- B) :: a change in X by one unit is associated with a \beta_{1} change in Y.
- C) :: a change in X by one unit is associated with a 100 \beta_{1} % change in Y.
- D) :: a 1% change in X is associated with a change in Y of 0.01\beta_{1}.
\pause
Answer: A

*** In the regression model $Y_i = \beta_0 + \beta_1 X_i + \beta_2 D_i + \beta_3 (X_i \times D_i) + u_i$, where X is a continuous variable and D is a binary variable, to test that the two regressions are identical, you must use the
- A) :: t-statistic separately for $\beta_2 = 0, \beta_3 = 0$. 
- B) :: F-statistic for the joint hypothesis that $\beta_0 = 0,
        \beta_1 = 0$
- C) :: t-statistic separately for $\beta_3 = 0$
- D) :: F-statistic for the joint hypothesis that $\beta_2 = 0,
        \beta_3 = 0$. 
\pause
Answer:  D

\pause
*** (Requires Calculus)  In the equation $\widehat{TestScore} = 607.3 + 3.85 Income - 0.0423 Income^2$, the following income level results in the maximum test score
- A) :: 607.3.
- B) :: 91.02.
- C) :: 45.50.
- D) :: cannot be determined without a plot of the data.
\pause
Answer:  C

* COMMENT Introduction
** Introduction 
*** Overview
The preceding lectures explain how to use multiple regression to
analyze the relationship among variables. In this lecture, we step
back and ask, What makes a study that uses multiple regression
reliable? We answer this question by assessing regression analysis
under the framework of internal and external validity. 

*** Reading materials
- Chapter 9 in /Introduction to Econometrics/ by Stock and Watson. 

* Internal and External Validity
#+TOC: headlines [currentsection]
** An over view of internal and external validity

- The concepts of internal and external validity provide a general
  framework for assessing whether a statistical or econometric study is
  useful for answering a specific question of interest. 

\vspace{0.1cm} 

- We focus on regression analysis that have the objective
  of estimating the causal effect of a change in some independent
  variable on a dependent variable.

** The population and setting studied versus the population and setting of interest
*** The population and setting studied
- The population studied is the population of entities-people,
  companies, school districts, and so forth-from which the sample is
  drawn. 
- The setting studied refers to as the institutional, legal, social,
  and economic environment in which the population studied fits in and
  the sample is drawn. 

*** The population and setting of interest
- The population and setting of interest is the population
  and setting of entities to which the causal inferences from the study
  are to be applied. 

** Definition of internal and external validity
*** Internal validity

The statistical inferences about causal effects are valid for the
population being studied.

*** External validity

The statistical inferences can be generalized from the population and
setting studied to other populations and settings of interest. 

** Threats to internal validity
*** Internal validity consists of two components

- The estimator of the causal effect should be unbiased and
  consistent.
- Hypothesis tests should have the desired significance level, and the
  confidence intervals should have the desired confidence level.

*** Internal validity in regression analysis

1) the OLS estimator is unbiased and consistent, and
2) the standard errors are computed in the correct way that makes
   confidence intervals have the desired confidence level.

** Threats to external validity

*** Differences in populations
The causal effect may be different regarding different populations
- demographic and personal characteristics
- geographic and climate features
- timing

*** Differences in settings
- Difference in institutional environment, laws, or physical
  environment. 

*** How to assess the external validity of a study
- Use specific knowledge.
- Case-by-case judgment. 

** Threats to Internal Validity of Multiple Regression Analysis
We introduce five threats to the internal validity of regression studies:
1. Omitted variable bias
2. Wrong functional form
3. Errors-in-variables bias
4. Sample selection bias
5. Simultaneous causality bias

\vspace{0.3cm} 
All of these imply that $E(u_i|X_{1i},…,X_{ki}) \neq 0$ so as to make
the OLS estimators biased and inconsistent.  

* Omitted Variable Bias
** Omitted variable bias

What are the two conditions for omitted variable bias?
\pause
1. At least one of the included regressors must be correlated with the
   omitted variable.
2. The omitted variable must be a determinant of the dependent
   variable, $Y$.

** Solutions to omitted variable bias when the variable is observed or there are adequate control variables

- Include the omitted variables or the control variables
  - Avoid the violation of the first least squares assumption, $E(u |
    X ) = 0$ or to let the conditional mean independence assumption
    hold, i.e., $E(u|X, W) = E(u|X)$

\vspace{0.2cm} 

- Adding an additional independent variable may reduce the precision of the
  estimators of the coefficients 
  - when the new variable actually does not belong to the population
    regression function,
  - when the new variable is correlated with other regressors.

** Solutions to omitted variable bias when the variable is observed or there are adequate control variables

1. Identify the key coefficient(s) of interest.

2. /a priori/ reasoning: before analyzing data, you should consider
   - What are the most likely sources of important omitted variable?
   - Answer the question using economic theory and expert knowledge.

3. Result in a base specification and a list of additional
   questionable variables that might help mitigate possible omitted
   variable bias.

4. Augment your base specification with the additional questionable
   control variables.

5. Present an accurate summary of your results in tabular form.

** Solutions to omitted variable bias when adequate control variables are not available

- Panel data regression;
- Instrumental variables regression;
- Randomized controlled experiment. 

** COMMENT Panel data regression \\ \small Panel data 

Panel data (or longitudinal data) consist of observations on the same $n$ entities at two or
more time periods. If the data set contains observations on the
variables $X$ and $Y$, then the data are denoted
\[ (X_{it}, Y_{it}),\; i = 1, \ldots, n \text{ and } t = 1, \ldots, T \]
where the first subscript, $i$, refers to the entity being observed
and the second subscript, $t$, refers to the date at which it is
observed. 

The key of using panel data regression to circumvent omitted variable
bias lies in the idea that omitted variables that represent personal
characteristics do not change over time so that any changes in $Y$
over time cannot be caused by the omitted variable.

