handouts/lecture_notes/lecture_11/slides_lecture_11.tex
% Created 2017-05-31 Wed 08:02
% -*- latex-run-command: pdflatex -*-
\documentclass[presentation,10pt]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsthm}
\usepackage{amsmath}
\usepackage{mathtools}
\newtheorem{mydef}{Definition}
\newtheorem{mythm}{Theorem}
\newcommand{\dx}{\mathrm{d}}
\newcommand{\var}{\mathrm{var}}
\newcommand{\cov}{\mathrm{cov}}
\newcommand{\corr}{\mathrm{corr}}
\newcommand{\pr}{\mathrm{Pr}}
\newcommand{\rarrowd}[1]{\xrightarrow{\text{ \textit #1 }}}
\DeclareMathOperator*{\plim}{plim}
\newcommand{\plimn}{\plim_{n \rightarrow \infty}}
\usepackage{booktabs}
\usepackage{color}
\usepackage{caption}
\usepackage{subcaption}
\usetheme{CambridgeUS}
\usecolortheme{beaver}
\author{Zheng Tian}
\date{}
\title{Lecture 11: Assessing Studies Based on Multiple Regression}
\hypersetup{
 pdfauthor={Zheng Tian},
 pdftitle={Lecture 11: Assessing Studies Based on Multiple Regression},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\setcounter{tocdepth}{1}
\tableofcontents
\end{frame}


\section{Internal and External Validity}
\label{sec:orgf5f65ae}
\setcounter{tocdepth}{1}
\tableofcontents[currentsection]
\begin{frame}[label={sec:orgecf9c5a}]{An over view of internal and external validity}
\begin{itemize}
\item The concepts of internal and external validity provide a general
framework for assessing whether a statistical or econometric study is
useful for answering a specific question of interest.
\end{itemize}

\vspace{0.1cm} 

\begin{itemize}
\item We focus on regression analysis that have the objective
of estimating the causal effect of a change in some independent
variable on a dependent variable.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgf98264a}]{The population and setting studied versus the population and setting of interest}
\begin{block}{The population and setting studied}
\begin{itemize}
\item The population studied is the population of entities-people,
companies, school districts, and so forth-from which the sample is
drawn.
\item The setting studied refers to as the institutional, legal, social,
and economic environment in which the population studied fits in and
the sample is drawn.
\end{itemize}
\end{block}

\begin{block}{The population and setting of interest}
\begin{itemize}
\item The population and setting of interest is the population
and setting of entities to which the causal inferences from the study
are to be applied.
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label={sec:org9920855}]{Definition of internal and external validity}
\begin{block}{Internal validity}
The statistical inferences about causal effects are valid for the
population being studied.
\end{block}

\begin{block}{External validity}
The statistical inferences can be generalized from the population and
setting studied to other populations and settings of interest. 
\end{block}
\end{frame}

\begin{frame}[label={sec:org05e3142}]{Threats to internal validity}
\begin{block}{Internal validity consists of two components}
\begin{itemize}
\item The estimator of the causal effect should be unbiased and
consistent.
\item Hypothesis tests should have the desired significance level, and the
confidence intervals should have the desired confidence level.
\end{itemize}
\end{block}

\begin{block}{Internal validity in regression analysis}
\begin{enumerate}
\item the OLS estimator is unbiased and consistent, and
\item the standard errors are computed in the correct way that makes
confidence intervals have the desired confidence level.
\end{enumerate}
\end{block}
\end{frame}

\begin{frame}[label={sec:org3a5804e}]{Threats to external validity}
\begin{block}{Differences in populations}
The causal effect may be different regarding different populations
\begin{itemize}
\item demographic and personal characteristics
\item geographic and climate features
\item timing
\end{itemize}
\end{block}

\begin{block}{Differences in settings}
\begin{itemize}
\item Difference in institutional environment, laws, or physical
environment.
\end{itemize}
\end{block}

\begin{block}{How to assess the external validity of a study}
\begin{itemize}
\item Use specific knowledge.
\item Case-by-case judgment.
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label={sec:orgca16e2e}]{Threats to Internal Validity of Multiple Regression Analysis}
We introduce five threats to the internal validity of regression studies:
\begin{enumerate}
\item Omitted variable bias
\item Wrong functional form
\item Errors-in-variables bias
\item Sample selection bias
\item Simultaneous causality bias
\end{enumerate}

\vspace{0.3cm} 
All of these imply that \(E(u_i|X_{1i},…,X_{ki}) \neq 0\) so as to make
the OLS estimators biased and inconsistent.  
\end{frame}

\section{Omitted Variable Bias}
\label{sec:orgb2fba87}
\begin{frame}[label={sec:org0e67561}]{Omitted variable bias}
What are the two conditions for omitted variable bias?
\pause
\begin{enumerate}
\item At least one of the included regressors must be correlated with the
omitted variable.
\item The omitted variable must be a determinant of the dependent
variable, \(Y\).
\end{enumerate}
\end{frame}

\begin{frame}[label={sec:org6303ef6}]{Solutions to omitted variable bias when the variable is observed or there are adequate control variables}
\begin{itemize}
\item Include the omitted variables or the control variables
\begin{itemize}
\item Avoid the violation of the first least squares assumption, \(E(u |
    X ) = 0\) or to let the conditional mean independence assumption
hold, i.e., \(E(u|X, W) = E(u|X)\)
\end{itemize}
\end{itemize}

\vspace{0.2cm} 

\begin{itemize}
\item Adding an additional independent variable may reduce the precision of the
estimators of the coefficients 
\begin{itemize}
\item when the new variable actually does not belong to the population
regression function,
\item when the new variable is correlated with other regressors.
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgf02618b}]{Solutions to omitted variable bias when the variable is observed or there are adequate control variables}
\begin{enumerate}
\item Identify the key coefficient(s) of interest.

\item \emph{a priori} reasoning: before analyzing data, you should consider
\begin{itemize}
\item What are the most likely sources of important omitted variable?
\item Answer the question using economic theory and expert knowledge.
\end{itemize}

\item Result in a base specification and a list of additional
questionable variables that might help mitigate possible omitted
variable bias.

\item Augment your base specification with the additional questionable
control variables.

\item Present an accurate summary of your results in tabular form.
\end{enumerate}
\end{frame}

\begin{frame}[label={sec:org567de93}]{Solutions to omitted variable bias when adequate control variables are not available}
\begin{itemize}
\item Panel data regression;
\item Instrumental variables regression;
\item Randomized controlled experiment.
\end{itemize}
\end{frame}
