handouts/lecture_notes/lecture_11/slides_lecture_11.org
** COMMENT Panel data regression \\ \small The fixed effects panel data regression model
Suppose we have $n$ entities and $T$ observations for each
entity. $X_{it}$ is the observed regressor, $Y_{it}$ is the dependent
variable, and $Z_i$ is the unobserved time-invariant variable
representing idiosyncratic characteristics of entity $i$. We can set
up a linear regression model as follows 
\[ Y_{it} = \beta_0 + \beta_1 X_{it} +
\beta_2 Z_i + u_{it} \] 
This model is a simple representation of the *fixed effects* panel
data regression model, in which $Z_i$ is usually defined as a dummy
variable for entity $i$. 

\vspace{0.3cm} 
Panel data regressions are discussed in Chapter 10. 

** COMMENT Instrumental variables regression
:PROPERTIES:
:BEAMER_opt: shrink
:END:

If the omitted variable(s) cannot be measured, we can use an instrumental
variables (IV) regression. Suppose that in the simple linear
regression model
\[ Y_i = \beta_0 + \beta_1 X_i + u_i, i = 1, \ldots, n \]
$X_i$ and $u_i$ are correlated due to unobserved omitted
variables. Then we can use an instrumental variable $Z$ to account for
the part in $X$ that is correlated with $u$. 
*** The validity of an instrumental variable
For an instrumental variable $Z$ to be valid, it
must satisfy two conditions: 
1. *Instrument relevance*: $\corr(Z_i, X_i) \neq 0$
2. *Instrument exogeneity*: $\corr(Z_i, u_i) = 0$

*** The two-stage-least-squares method
The model is estimated using the Two-Stage-Least-Squares (TSLS) method
which basically consists of two steps:
- Stage 1 :: Regress $X_i$ on $Z_i$, including an intercept, obtain
             the predicted values, $\hat{X}_i$.
- Stage 2 :: Regress $Y_i$ on $\hat{X}_i$, including an intercept; the
             coefficient on $\hat{X}_i$ is the TSLS estimator
             $\hat{\beta}_1^{TSLS}$. 

The IV estimation is discussed in Chapter 12. 

** COMMENT Randomized controlled experiment

The third solution is to use a research design in which the effect of
interest is studied using a randomized controlled
experiment. Randomized controlled experiments are discussed in
Chapter 12.

* Misspecification of the Functional Form 

** Misspecification of the functional form of the regression function

- Functional form misspecification arises when the functional form of
  the estimated regression function differs from the functional form of
  the population regression function. 
  - e.g., nonlinear vs. linear models

\vspace{0.1cm}

- Functional form misspecification bias can be considered as a type of
  omitted variable bias, in which the omitted variables are the terms
  that reflect the missing nonlinear aspects of the regression
  function. 
  - e.g., missing the quadratic term

** Solutions to functional form misspecification

- Plotting the data and the estimated regression function.

\vspace{0.1cm}

- Use a different functional form.
  - Continuous dependent variable:  use the “appropriate” nonlinear
    specifications in X (logarithms, interactions, etc.) 
  - Discrete (example: binary) dependent variable:  need an extension of
    multiple regression methods (“probit” or “logit” analysis for binary
    dependent variables) 

* Measurement Errors and Errors-in-Variable Bias

** Measurement error and errors-in-variable bias

Measurement errors often happen in practice. 
- respondents misstated answers to survey questions
- typographical errors when data were entered into the database
- the malfunctions of machines when recording data. 

\vspace{0.1cm}

Measurement errors in
- dependent variable
- independent variable \Rightarrow *errors-in-variable bias*.

** Definition of errors-in-variable bias

- *Errors-in-variables bias* in the OLS estimator arises when an
  independent variable is measured imprecisely. 

\vspace{0.3cm}

- This bias depends on the nature of the measurement error and persists
  even if the sample size is large.

** Mathematical illustration of errors-in-variable bias
- The population regression model is 
  \[ Y_i = \beta_0 + \beta_1 X_i + u_i, \text{ where } E(u_i | X_i) =
  0 \text{ is satisfied}  \]

- Suppose a regressor $X_i$ is imprecisely measured by
  $\tilde{X}_i$.
  - The measurement error is $w_i = \tilde{X}_i - X_i$.
  - Assume $E(w_i) = 0$ and $\var(w_i) = \sigma^2_w$.

- Rewrite the model in terms of $\tilde{X}_i$,
  \begin{equation}
  \begin{split}
  Y_i &= \beta_0 + \beta_1 \tilde{X}_i + [\beta_1 (X_i - \tilde{X}_i) + u_i] \\
      &= \beta_0 + \beta_1 \tilde{X}_i + v_i \label{eq:err-in-var}
  \end{split}
  \end{equation}
  - The new error term is $v_i = \beta_1(X_i - \tilde{X}_i) + u_i$

- If $\cov(w_i, \tilde{X}_i) \neq 0$, then $\cov(v_i, \tilde{X}_i)
  \neq 0$ and the OLS estimator $\hat{\beta}_1$ is biased since
  $E(v_i | \tilde{X}_i) \neq 0$.

** The biased and inconsistent OLS estimator with measurement errors

- If $\cov(w_i, \tilde{X}_i) \neq 0$, then $\cov(v_i, \tilde{X}_i)
  \neq 0$ and the OLS estimator $\hat{\beta}_1$ is biased since
  $E(v_i | \tilde{X}_i) \neq 0$.

\vspace{0.3cm}

- The OLS estimator is inconsistent.
  - The precise size and direction of the bias in $\hat{\beta}_1$ depend
    on the correlation between $\tilde{X}_i$ and the measurement error
    $w_i$. This correlation depends, in turn, on the specific nature of
    the measurement error. 

** The classical measurement error model

- The classical measurement error model assumes that the errors are
  purely random. 
  $$\corr(w_i, X_i) = 0 \text{ and }\corr(w_i, u_i) = 0$$

- The errors are correlated with $\tilde{X}_i$, that is,
  $\corr(\tilde{X}_i, w_i) \neq 0$. 

- In the classical measurement model, the OLS estimator
  $\hat{\beta}_1$ is inconsistent, and its the probability limit is
  \begin{equation}
  \label{eq:eiv-lim}
  \hat{\beta}_1 \rarrowd{p} \frac{\sigma^2_X}{\sigma^2_X + \sigma^2_w}\beta_1
  \end{equation}

- Since $\frac{\sigma^2_X}{\sigma^2_X + \sigma^2_w} < 1$, Equation
  (\ref{eq:eiv-lim}) implies that
  $\hat{\beta}_1$ is biased toward 0.
  - When $\sigma^2_w$ is very large, then $\hat{\beta}_1 \rarrowd{p} 0$;
  - When $\sigma^2_w$ is very small, then $\hat{\beta}_1 \rarrowd{p} \beta_1$.

** COMMENT The classical measurement error model (cont'd)
:PROPERTIES:
:BEAMER_opt: shrink
:END:

Since $\tilde{X}_i = X_i + w_i$, we have $\var(\tilde{X}_i) = \sigma^2_{X} + \sigma^2_w$. 

According to Equation (\ref{eq:eiv-lim}) and $\cov(X_i, u_i) = 0$, we have
\begin{gather*}
v_i = \beta_1 (X_i - \tilde{X}_i) + u_i = -\beta_1 w_i + u_i \\
\cov(\tilde{X}_i, w_i) = \cov(X_i + w_i, w_i) = \sigma^2_w \\
\cov(\tilde{X}_i, v_i) = -\beta_1 \cov(\tilde{X}_i, w_i) + \cov(\tilde{X}_i, u_i) = -\beta_1 \sigma^2_w
\end{gather*}

Recall that when the error term is correlated with the regressor, like
$\cov(\tilde{X}_i, v_i) \neq 0$, then $\hat{\beta_1}$ has the
probability limit 
\[\hat{\beta}_1 \rarrowd{p} \beta_1 +
\frac{\cov(\tilde{X}_i, v_i)}{\var(\tilde{X}_i)} \] 
for which the
probability limit is just 
\[ \beta_1 - \beta_1
\frac{\sigma^2_w}{\sigma^2_{\tilde{X}_i}} =
\frac{\sigma^2_X}{\sigma^2_X + \sigma^2_w}\beta_1 \]

** COMMENT The modeling of error-in-variable bias \\ \small The best-guess error model

In contrast with the classical error model, the best-guess model
assume that $w_i$ and $\tilde{X}_i$ are uncorrelated in the sense that
$\tilde{X}_i$ is the best guess about $X_i$ given all available
information. 

- $\tilde{X}_i$ is modeled as the conditional mean of $X_i$, given the
  information available to the respondent, that is, $\tilde{X}_i =
  E(X_i | \Phi_i)$, where $\Phi_i$ represents the all available data
  (or information), including $\tilde{X}_i$. It follows that
  $E(\tilde{X}_i - X_i | \tilde{X}_i) = 0$.

- Then, the measurement error is uncorrelated with $\tilde{X}_i$. That
  is,

  \[ E(w_i \tilde{X}_i) = E \left[ E \left( (\tilde{X}_i - X_i)\tilde{X}_i|
  \tilde{X}_i \right) \right] = E\left[ E\left( \tilde{X}_i - X_i |
  \tilde{X}_i \right) \tilde{X}_i \right] = 0\]

- If $\tilde{X}_i$ is uncorrelated with $u_i$, then $\tilde{X}_i$ is
  uncorrelated with $v_i$, that is, $E(v_i \tilde{X}_i) =
  0$.

- $\hat{\beta}_1$ is consistent but inefficient.

** Measurement error in Y
The effect of measurement error in Y is different from that in
X. Generally, measurement in Y that has conditional mean zero given
the regressors will not induce bias in the OLS coefficients, but will
lead to inefficient estimators. 

- Suppose Y has the classical measurement error, that is, what we
  observe, $\tilde{Y}_i$, is the true value of $Y_i$ plus a purely
  random error $w_i$. Then, the regression model is 
  \[ \tilde{Y}_i = \beta_0 + \beta_1 X_i + v_i, \text{ where } v_i = w_i +
  u_i\]
- If $w_i$ and $X_i$ are independently distributed so that $E(w_i | X_i)
  = 0$, in which case $E(v_i | X_i) = 0$, so $\hat{\beta}_1$ is
  unbiased.
- Since $\var(v_i) = \var(w_i) + \var(u_i) > \var(u_i)$, the variance
  of $\hat{\beta}_1$ is larger than it would be without measurement
  error. 

** Solutions to errors-in-variable bias
- Get an accurate measure of $X$ as possible as you can.
- Use an instrumental variable that is correlated with the actual
  value of $X_i$ but is uncorrelated with the measurement error.
- Develop a mathematical model of the measurement error and use the
  resulting formula to adjust the estimates. This requires specific
  knowledge of the errors. 

* Missing data and sample selection

