handouts/lecture_notes/lecture_11/slides_lecture_11.tex

\section{Misspecification of the Functional Form}
\label{sec:orgd5dd68e}

\begin{frame}[label={sec:org1a93d5e}]{Misspecification of the functional form of the regression function}
\begin{itemize}
\item Functional form misspecification arises when the functional form of
the estimated regression function differs from the functional form of
the population regression function. 
\begin{itemize}
\item e.g., nonlinear vs. linear models
\end{itemize}
\end{itemize}

\vspace{0.1cm}

\begin{itemize}
\item Functional form misspecification bias can be considered as a type of
omitted variable bias, in which the omitted variables are the terms
that reflect the missing nonlinear aspects of the regression
function. 
\begin{itemize}
\item e.g., missing the quadratic term
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orge09da65}]{Solutions to functional form misspecification}
\begin{itemize}
\item Plotting the data and the estimated regression function.
\end{itemize}

\vspace{0.1cm}

\begin{itemize}
\item Use a different functional form.
\begin{itemize}
\item Continuous dependent variable:  use the “appropriate” nonlinear
specifications in X (logarithms, interactions, etc.)
\item Discrete (example: binary) dependent variable:  need an extension of
multiple regression methods (“probit” or “logit” analysis for binary
dependent variables)
\end{itemize}
\end{itemize}
\end{frame}

\section{Measurement Errors and Errors-in-Variable Bias}
\label{sec:org98d3394}

\begin{frame}[label={sec:org3c9e060}]{Measurement error and errors-in-variable bias}
Measurement errors often happen in practice. 
\begin{itemize}
\item respondents misstated answers to survey questions
\item typographical errors when data were entered into the database
\item the malfunctions of machines when recording data.
\end{itemize}

\vspace{0.1cm}

Measurement errors in
\begin{itemize}
\item dependent variable
\item independent variable \(\Rightarrow\) \alert{errors-in-variable bias}.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgf411da2}]{Definition of errors-in-variable bias}
\begin{itemize}
\item \alert{Errors-in-variables bias} in the OLS estimator arises when an
independent variable is measured imprecisely.
\end{itemize}

\vspace{0.3cm}

\begin{itemize}
\item This bias depends on the nature of the measurement error and persists
even if the sample size is large.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgf1bf6c7}]{Mathematical illustration of errors-in-variable bias}
\begin{itemize}
\item The population regression model is 
\[ Y_i = \beta_0 + \beta_1 X_i + u_i, \text{ where } E(u_i | X_i) =
  0 \text{ is satisfied}  \]

\item Suppose a regressor \(X_i\) is imprecisely measured by
\(\tilde{X}_i\).
\begin{itemize}
\item The measurement error is \(w_i = \tilde{X}_i - X_i\).
\item Assume \(E(w_i) = 0\) and \(\var(w_i) = \sigma^2_w\).
\end{itemize}

\item Rewrite the model in terms of \(\tilde{X}_i\),
\begin{equation}
\begin{split}
Y_i &= \beta_0 + \beta_1 \tilde{X}_i + [\beta_1 (X_i - \tilde{X}_i) + u_i] \\
    &= \beta_0 + \beta_1 \tilde{X}_i + v_i \label{eq:err-in-var}
\end{split}
\end{equation}
\begin{itemize}
\item The new error term is \(v_i = \beta_1(X_i - \tilde{X}_i) + u_i\)
\end{itemize}

\item If \(\cov(w_i, \tilde{X}_i) \neq 0\), then \(\cov(v_i, \tilde{X}_i)
  \neq 0\) and the OLS estimator \(\hat{\beta}_1\) is biased since
\(E(v_i | \tilde{X}_i) \neq 0\).
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orga496ca0}]{The biased and inconsistent OLS estimator with measurement errors}
\begin{itemize}
\item If \(\cov(w_i, \tilde{X}_i) \neq 0\), then \(\cov(v_i, \tilde{X}_i)
  \neq 0\) and the OLS estimator \(\hat{\beta}_1\) is biased since
\(E(v_i | \tilde{X}_i) \neq 0\).
\end{itemize}

\vspace{0.3cm}

\begin{itemize}
\item The OLS estimator is inconsistent.
\begin{itemize}
\item The precise size and direction of the bias in \(\hat{\beta}_1\) depend
on the correlation between \(\tilde{X}_i\) and the measurement error
\(w_i\). This correlation depends, in turn, on the specific nature of
the measurement error.
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4c90cf8}]{The classical measurement error model}
\begin{itemize}
\item The classical measurement error model assumes that the errors are
purely random. 
$$\corr(w_i, X_i) = 0 \text{ and }\corr(w_i, u_i) = 0$$

\item The errors are correlated with \(\tilde{X}_i\), that is,
\(\corr(\tilde{X}_i, w_i) \neq 0\).

\item In the classical measurement model, the OLS estimator
\(\hat{\beta}_1\) is inconsistent, and its the probability limit is
\begin{equation}
\label{eq:eiv-lim}
\hat{\beta}_1 \rarrowd{p} \frac{\sigma^2_X}{\sigma^2_X + \sigma^2_w}\beta_1
\end{equation}

\item Since \(\frac{\sigma^2_X}{\sigma^2_X + \sigma^2_w} < 1\), Equation
(\ref{eq:eiv-lim}) implies that
\(\hat{\beta}_1\) is biased toward 0.
\begin{itemize}
\item When \(\sigma^2_w\) is very large, then \(\hat{\beta}_1 \rarrowd{p} 0\);
\item When \(\sigma^2_w\) is very small, then \(\hat{\beta}_1 \rarrowd{p} \beta_1\).
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgbc1fb09}]{Measurement error in Y}
The effect of measurement error in Y is different from that in
X. Generally, measurement in Y that has conditional mean zero given
the regressors will not induce bias in the OLS coefficients, but will
lead to inefficient estimators. 

\begin{itemize}
\item Suppose Y has the classical measurement error, that is, what we
observe, \(\tilde{Y}_i\), is the true value of \(Y_i\) plus a purely
random error \(w_i\). Then, the regression model is 
\[ \tilde{Y}_i = \beta_0 + \beta_1 X_i + v_i, \text{ where } v_i = w_i +
  u_i\]
\item If \(w_i\) and \(X_i\) are independently distributed so that \(E(w_i | X_i)
  = 0\), in which case \(E(v_i | X_i) = 0\), so \(\hat{\beta}_1\) is
unbiased.
\item Since \(\var(v_i) = \var(w_i) + \var(u_i) > \var(u_i)\), the variance
of \(\hat{\beta}_1\) is larger than it would be without measurement
error.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4057f8b}]{Solutions to errors-in-variable bias}
\begin{itemize}
\item Get an accurate measure of \(X\) as possible as you can.
\item Use an instrumental variable that is correlated with the actual
value of \(X_i\) but is uncorrelated with the measurement error.
\item Develop a mathematical model of the measurement error and use the
resulting formula to adjust the estimates. This requires specific
knowledge of the errors.
\end{itemize}
\end{frame}
