handouts/lecture_notes/lecture_11/slides_lecture_11.tex

\section{Missing data and sample selection}
\label{sec:orgc3ed249}

\begin{frame}[label={sec:orgb2cec50}]{Missing data and sample selection}
Whether missing data pose a threat to internal validity depends on why
the data are missing. We consider three cases of missing data.

\begin{block}{Missing data at random}
When data are missing completely at random, unrelated with \(X\) and
\(Y\), then the effect is to reduce the sample size but not introduce
any estimation bias. 
\end{block}

\begin{block}{Missing data based on \(X\)}
When the data are missing based on the value of a regressor but
unrelated with generating \(Y\), the effect is also to reduce the sample
size but not introduce bias. 
\end{block}

\begin{block}{Sample selection bias}
When the data are missing because of a selection process that is
related with the value of the dependent variable \(Y\), beyond depending
on the regressors \(X\), then this selection process can introduce
correlation between the error term and the regressors, resulting in
\alert{sample selection bias}.
\end{block}
\end{frame}


\begin{frame}[label={sec:org48e4990}]{Sample selection bias: two examples}
The sample selection problem can be cast either as a consequence of
nonrandom sampling or as a missing data problem, illustrated using the
following two examples. 

\begin{block}{Nonrandom sampling: Height of undergraduates}
The professor of Statistics asks you to estimate the mean height of
undergraduate males. You collect your data (obtain your sample) by
standing outside the basketball team’s locker room and recording the
height of the undergraduates who enter.
\end{block}

\begin{block}{Missing data: Trade volume of pairs of countries}
\begin{itemize}
\item The amount of commodities that two countries can trade depends on
GDP of two countries, industrial structures, factor abundance,
etc.
\item We can get the data on trade volume between pairs of countries
from World Bank, Penn World Table, etc.
\item Sample selection bias occurs due to the non-trading pairs.
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label={sec:orgabd2cad}]{Solutions to sample selection bias}
\begin{itemize}
\item Collect the sample in a way that avoids sample selection.
\item Heckman's two-step method.
\item Randomized controlled experiment.
\item Construct a model of the sample selection problem and estimate that
model.
\end{itemize}
\end{frame}

\section{Simultaneous causality}
\label{sec:orgbf32072}

\begin{frame}[label={sec:orga6f0a9a}]{Simultaneous causality}
Up to now, all we examined is how \(X\) can cause \(Y\). What if \(Y\) causes
\(X\)? If \(Y\) does cause \(X\) in some way, there is \alert{simultaneous
causality} problem, which lead to biased and inconsistent OLS
estimator. 

\vspace{0.3cm}
There are many examples of simultaneous causality in Economics. In the
paper of Acemuglou et al.(2000), \emph{The Colonial Origins of Comparative
Development: An Empirical Investigation}, the authors estimate the
effect of institutions on economic performance. However, the
simultaneous causality (or mutual causality) comes from the fact that
not only do good institutions promote economic performance, but also
countries with high GDP per capita can afford good institutions and
secure property rights, which in turn yield better economic
performance. 
\end{frame}

\begin{frame}[label={sec:org7de73b0}]{Simultaneous causality bias}
Simultaneous causality leads to biased estimates of the effect of \(X\)
on \(Y\), referred to as \alert{simultaneous causality bias}. We can express
the simultaneous causality using a simultaneous equations.
\begin{gather}
Y_i = \beta_0 + \beta_1 X_i + u_i \label{eq:sim-cau-1} \\
X_i = \gamma_0 + \gamma_1 Y_i + v_i \label{eq:sim-cau-2}
\end{gather}

Intuitively, simultaneous causality comes from the following facts. 
\begin{itemize}
\item Large \(u_i\) means large \(Y_i\), which implies large \(X_i\) (if
\(\gamma_1\) > 0).
\item This implies that \(u_i\) and \(X_i\) are correlated, i.e., \(\cov(X_i,
  u_i) \neq 0\).
\item Thus, the OLS estimator of \(\beta_1\) from merely estimating Equation
(\ref{eq:sim-cau-1}) is biased and inconsistent.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org663a255}]{Simultaneous causality bias (cont'd)}
Formally, we can prove that \(\cov(X_i, u_i) \neq 0\), resulting in the
bias in the OLS estimator of \(\beta_1\). 
\begin{proof}
\begin{align*}
\cov(X_i, u_i) &= \cov(\gamma_0 + \gamma_1 Y_i + v_i, u_i) \\
&= \gamma_1\cov(Y_i, u_i) + \cov(v_i, u_i) (\text{ Assuming } \cov(v_i, u_i)=0) \\
&= \gamma_1\cov(\beta_0 + \beta_1 X_i + u_i, u_i) \\
&= \gamma_1\cov(X_i, u_i) + \gamma_1\sigma^2_u
\end{align*}
Solving for $\cov(X_i, u_i)$ yields the result 
$\cov(X_i, u_i) = \gamma_1 \sigma^2_u /(1-\gamma_1\beta_1)$, which is not
equal to zero unless $\gamma_1 = 0$, i.e., the simultaneous causality does
exist. 
\end{proof}
\end{frame}

\begin{frame}[label={sec:org69b64f2}]{Solutions to simultaneous causality bias}
\begin{itemize}
\item Run a randomized controlled experiment.  Because \(X_i\) is chosen at
random by the experimenter, there is no feedback from the outcome
variable to \(Y_i\) (assuming perfect compliance).
\item Develop and estimate a complete model of both directions of
causality.  This is the idea behind many large macro models
(e.g. Federal Reserve Bank-US).  This is extremely difficult in
practice.
\item Use instrumental variables regression to estimate the causal effect
of interest (effect of X on Y, ignoring effect of Y on X)
\end{itemize}
\end{frame}

\section{Inconsistency of Standard Errors}
\label{sec:org282e567}

\begin{frame}[label={sec:org0c88974}]{Sources of inconsistency of OLS standard errors}
Inconsistent standard errors pose a different threat to internal
validity. Even if the OLS estimator is consistent and the sample is
large, inconsistent standard errors will produce hypothesis tests with
size that differs from the desired significance level and "95\%"
confidence intervals that fail to include the true value in 95\% of
repeated samples. 

\vspace{0.3cm}
There are two main reasons for inconsistent standard errors:
improperly handled heteroskedasticity and correlation of the error
term across observations.
\end{frame}

\begin{frame}[label={sec:orgaeb8fe8}]{Heteroskedasticity}
If the errors are heteroskedastic and you mistakenly use the
homoskedasticity-only standard errors that are reported by some
software by default, then the t-test and the F-test based on the wrong
standard errors do not have the desired size. 

\vspace{0.3cm}
The solution to this problem is to use heteroskedasticity-robust
standard errors of the OLS estimators and to construct t- and
F-statistics using a heteroskedasticity-robust variance estimator,
which is provided as an option in modern software packages. 
\end{frame}

\begin{frame}[shrink,label={sec:org05e6dfe}]{The Breusch-Pagan test for heteroskedasticity}
We can test whether heteroskedasticity exists in a regression model
using the Breusch-Pagan test. The test consist of the following steps: 
\begin{enumerate}
\item Estimate a regression model, \(Y = \beta_0 + \beta_1 X_1 + \cdots +
   \beta_k X_k + u\), and obtain the squared OLS residuals,
\(\hat{u}^2\).
\item Run a regression of \(\hat{u}^2 = \delta_0 + \delta_1 X_1 + \cdots +
   \delta_k X_k + v\), and obtain the \(R^2\) of this regression, denoted
as \(R^2_{\hat{u}^2}\).
\item Test the null hypothesis, \(H_0: E(u^2 | X_1, \ldots, X_k) =
   \sigma^2\), i.e., homoskedasticity, against the alternative
hypothesis for heteroskedasticity. The test statistics can be the
overall F statistics for the regression in the second step, which
is
\[ F = \frac{R^2_{\hat{u}^2}/k}{(1 - R^2_{\hat{u}^2})/(n-k-1)} \sim
   F(k, n-k-1)\]
Or we can compute an LM test statistics, which is
\[ LM = n R^2_{\hat{u}^2} \sim \chi^2(k) \]
where \(n\) is the number of observations.
\item Based on the F-statistic or the LM statistic, compute the
p-value. If the p-value is smaller than the significance level, we
can reject the null hypothesis of homoskedasticity.
\end{enumerate}
\end{frame}
