handouts/lecture_notes/lecture_11/slides_lecture_11.org
** Correlation of the error term across observations
In the lease squares assumptions, we assume that $(X_i, Y_i)$ for
$i=1, \ldots, n$ are i.i.d., which implies that $u_i$ are uncorrelated
across observations. However, in some setting, the population
regression error can be correlated across observations. There are
mainly two types of correlation in consideration: serial correlation
and spatial correlation. 

- Serial correlation arises from the repeated observations over the
  same entity over time. It is a prevalent problem in time series
  data. 
- Spatial correlation arises from the influence of contiguous
  (neighboring) observations over geographic units.
- The OLS estimator with serial correlation or spatial correlation is
  still unbiased and consistent, but inference based on no correlation
  assumption is not valid.

** Solutions to correlation of the error term across observations
- Use the *heteroskedasticity-and-auto-correlation-consistent
  standard errors (HAC)*. We will learn how to handle serial
  correlation in time series data in the next two semesters. 

\vspace{0.3cm}
- Model the spatial correlation specifically. Spatial econometrics
  is a branch of econometrics that deals with spatial correlation. 
